dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxEray_reg.h
/** \brief 610, Read Data Section 5 */
#define ERAY0_RDDS_1S4 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C610u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S4.
* To use register names with standard convension, please use ERAY0_RDDS_1S4.
*/
#define ERAY0_RDDS05 (ERAY0_RDDS_1S4)

/** \brief 614, Read Data Section 6 */
#define ERAY0_RDDS_1S5 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C614u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S5.
* To use register names with standard convension, please use ERAY0_RDDS_1S5.
*/
#define ERAY0_RDDS06 (ERAY0_RDDS_1S5)

/** \brief 618, Read Data Section 7 */
#define ERAY0_RDDS_1S6 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C618u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S6.
* To use register names with standard convension, please use ERAY0_RDDS_1S6.
*/
#define ERAY0_RDDS07 (ERAY0_RDDS_1S6)

/** \brief 61C, Read Data Section 8 */
#define ERAY0_RDDS_1S7 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C61Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S7.
* To use register names with standard convension, please use ERAY0_RDDS_1S7.
*/
#define ERAY0_RDDS08 (ERAY0_RDDS_1S7)

/** \brief 620, Read Data Section 9 */
#define ERAY0_RDDS_1S8 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C620u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S8.
* To use register names with standard convension, please use ERAY0_RDDS_1S8.
*/
#define ERAY0_RDDS09 (ERAY0_RDDS_1S8)

/** \brief 624, Read Data Section 10 */
#define ERAY0_RDDS_1S9 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C624u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S9.
* To use register names with standard convension, please use ERAY0_RDDS_1S9.
*/
#define ERAY0_RDDS10 (ERAY0_RDDS_1S9)

/** \brief 628, Read Data Section 11 */
#define ERAY0_RDDS_1S10 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C628u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S10.
* To use register names with standard convension, please use ERAY0_RDDS_1S10.
*/
#define ERAY0_RDDS11 (ERAY0_RDDS_1S10)

/** \brief 62C, Read Data Section 12 */
#define ERAY0_RDDS_1S11 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C62Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S11.
* To use register names with standard convension, please use ERAY0_RDDS_1S11.
*/
#define ERAY0_RDDS12 (ERAY0_RDDS_1S11)

/** \brief 630, Read Data Section 13 */
#define ERAY0_RDDS_1S12 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C630u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S12.
* To use register names with standard convension, please use ERAY0_RDDS_1S12.
*/
#define ERAY0_RDDS13 (ERAY0_RDDS_1S12)

/** \brief 634, Read Data Section 14 */
#define ERAY0_RDDS_1S13 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C634u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S13.
* To use register names with standard convension, please use ERAY0_RDDS_1S13.
*/
#define ERAY0_RDDS14 (ERAY0_RDDS_1S13)

/** \brief 638, Read Data Section 15 */
#define ERAY0_RDDS_1S14 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C638u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S14.
* To use register names with standard convension, please use ERAY0_RDDS_1S14.
*/
#define ERAY0_RDDS15 (ERAY0_RDDS_1S14)

/** \brief 63C, Read Data Section 16 */
#define ERAY0_RDDS_1S15 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C63Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S15.
* To use register names with standard convension, please use ERAY0_RDDS_1S15.
*/
#define ERAY0_RDDS16 (ERAY0_RDDS_1S15)

/** \brief 640, Read Data Section 17 */
#define ERAY0_RDDS_1S16 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C640u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S16.
* To use register names with standard convension, please use ERAY0_RDDS_1S16.
*/
#define ERAY0_RDDS17 (ERAY0_RDDS_1S16)

/** \brief 644, Read Data Section 18 */
#define ERAY0_RDDS_1S17 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C644u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S17.
* To use register names with standard convension, please use ERAY0_RDDS_1S17.
*/
#define ERAY0_RDDS18 (ERAY0_RDDS_1S17)

/** \brief 648, Read Data Section 19 */
#define ERAY0_RDDS_1S18 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C648u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S18.
* To use register names with standard convension, please use ERAY0_RDDS_1S18.
*/
#define ERAY0_RDDS19 (ERAY0_RDDS_1S18)

/** \brief 64C, Read Data Section 20 */
#define ERAY0_RDDS_1S19 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C64Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S19.
* To use register names with standard convension, please use ERAY0_RDDS_1S19.
*/
#define ERAY0_RDDS20 (ERAY0_RDDS_1S19)

/** \brief 650, Read Data Section 21 */
#define ERAY0_RDDS_1S20 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C650u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S20.
* To use register names with standard convension, please use ERAY0_RDDS_1S20.
*/
#define ERAY0_RDDS21 (ERAY0_RDDS_1S20)

/** \brief 654, Read Data Section 22 */
#define ERAY0_RDDS_1S21 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C654u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S21.
* To use register names with standard convension, please use ERAY0_RDDS_1S21.
*/
#define ERAY0_RDDS22 (ERAY0_RDDS_1S21)

/** \brief 658, Read Data Section 23 */
#define ERAY0_RDDS_1S22 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C658u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S22.
* To use register names with standard convension, please use ERAY0_RDDS_1S22.
*/
#define ERAY0_RDDS23 (ERAY0_RDDS_1S22)

/** \brief 65C, Read Data Section 24 */
#define ERAY0_RDDS_1S23 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C65Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S23.
* To use register names with standard convension, please use ERAY0_RDDS_1S23.
*/
#define ERAY0_RDDS24 (ERAY0_RDDS_1S23)

/** \brief 660, Read Data Section 25 */
#define ERAY0_RDDS_1S24 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C660u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S24.
* To use register names with standard convension, please use ERAY0_RDDS_1S24.
*/
#define ERAY0_RDDS25 (ERAY0_RDDS_1S24)

